app/views/inputs/_form.html.erb

SELECT "tasks".* FROM "tasks"
---
    <%= form.label :task_id %>
    <%= select("input", "task_id", Task.all.collect { |t| [t.id] }, { include_blank: true }) %>