app/views/inputs/edit.html.erb

SELECT "tasks".* FROM "tasks"
---

<%= select("input", "task_id", Task.all.collect { |b| [b.id] }, { include_blank: true }) %>