app/controllers/inputs_controller.rb

  def index
    @inputs = Input.all
---
SELECT "inputs".* FROM "inputs"

  def create
    @input = Input.new(input_params)

    respond_to do |format|
      if @input.save
---
INSERT INTO "inputs" ("body", "created_at", "updated_at", "task_id") VALUES (?, ?, ?, ?)  [["body", "7"], ["created_at", "2017-11-18 16:11:40.155053"], ["updated_at", "2017-11-18 16:11:40.155053"], ["task_id", 7]]

  def update
    respond_to do |format|
      if @input.update(input_params)
---
UPDATE "inputs" SET "body" = ?, "updated_at" = ? WHERE "inputs"."id" = ?  [["body", "портфолио1"], ["updated_at", "2017-11-18 17:30:15.329437"], ["id", 1]]

  def destroy
    @input.destroy
---
DELETE FROM "inputs" WHERE "inputs"."id" = ?  [["id", 1]]

    def set_input
      @input = Input.find(params[:id])
---
SELECT  "inputs".* FROM "inputs" WHERE "inputs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]