app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "inputs".* FROM "inputs"
---
  def index
    @tasks = Task.all
    @inputs = Input.all

INSERT INTO "tasks" ("created_at", "updated_at", "title") VALUES (?, ?, ?)  [["created_at", "2017-11-18 16:27:47.753908"], ["updated_at", "2017-11-18 16:27:47.753908"], ["title", "1"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save